def crete_recipe(m1, m2, m3):
    pt = '{:.3f}'.format(m1 / 1000)
    pu = '{:.3f}'.format(m2 / 1000)
    mat = '{:.3f}'.format(m3 / 1000)

    return (f'Рецепт\n'
            f'политическая теория: {pt} кг.\n'
            f'история политических учений: {pu} кг.\n'
            f'математика: {mat} кг.\n'
            f'Приправить политической историей. Добавить математические модели по вкусу.')


mass1 = int(input('Сколько политической теории (г.): '))
mass2 = int(input('Сколько политических учений (г.): '))
mass3 = int(input('Сколько математики (г.): '))

print(crete_recipe(mass1, mass2, mass3))

